Repository: shujincai/lock
Catalog: lock/*.lproj/InfoPlist.strings
Languages: ru

# CFBundleDisplayName
source: JWM LOCK
ru: VANMA LOCK

# NSBluetoothAlwaysUsageDescription
source: App needs your permission to access Bluetooth, To facilitate the connection of the key
ru: Предоставьте приложению разрешение к Bluetooth, чтобы использовать ключ (и)

# NSBluetoothPeripheralUsageDescription
source: App needs your permission to access Bluetooth, To facilitate the connection of the key
ru: Предоставьте приложению разрешение к Bluetooth, чтобы использовать ключ (и)

# NSCameraUsageDescription
source: Allow APP to access to the Camera？In order to scan QR code and so on
ru: предоставьте приложению доступ к камере, для сканирования QR-кода

# NSLocationAlwaysAndWhenInUseUsageDescription
source: Allow system to access this device’s location, To help you locate yourself
ru: Предоставьте приложению доступ к определению GPS, чтобы видеть себя на карте

# NSLocationWhenInUseUsageDescription
source: Allow system to access this device’s location, To help you locate yourself
ru: AПредоставьте системе доступ к местоположению этого устройства, чтобы помочь вам найти себя

# NSLocationAlwaysUsageDescription
source: The app needs your consent to always access the location, To help you locate yourself
ru: Предоставьте навсегда приложению доступ к определению GPS, чтобы видеть себя на карте

# NSPhotoLibraryUsageDescription
source: Allow APP to access to the gallery？In order to scan QR code and so on
ru: Предоставьте приложению доступ к галерее, для сканирования QR-кода

# 网络连接超时
source: Network connection timeout
ru: Тайм-аут сетевого подключения

# 解析失败
source: Parsing failed
ru: Не удалось выполнить анализ

# 加载中
source: Loading
ru: Загрузка

# 保存
source: Save
ru: Сохранить

# 相册
source: Gallery
ru: Галерея

# 提示
source: Notice
ru: Уведомления

# 知道了
source: Got it
ru: Получено

# 时间
source: Time
ru: Время

# 注册
source: Register
ru: Регистрация

# 提交数据失败
source: Data submission failed
ru: Не удалось отправить данные

# 暂无数据
source: No data
ru: Нет данных

# 注意
source: Attention
ru: Внимание

# 取消
source: Cancel
ru: Отмена

# 确定
source: Confirm
ru: Подтвердить

# 请输入服务器地址
source: Please enter the server address
ru: Введите адрес сервера

# 二维码
source: QR code
ru: QR-код

# 将取景框对准二维码,即可自动扫描
source: Align the viewfinder with the QR code
ru: Совместите видоискатель с QR-кодом

# 条码
source: Barcode
ru: Штрихкод

# 将取景框对准条码,即可自动扫描
source: Align the viewfinder with the Barcode
ru: Совместите видоискатель сj штрихкодом

# 图片中未识别到二维码
source: Failed to detect QR code
ru: Не удалось найти QR-код

# 相册读取权限未开启
source: The gallery read permission is not enabled
ru: Доступ приложению к галерее не предоставлен

# 请到手机系统的 【设置】->【隐私】->【相册】 对%@开启相机的访问权限
source: Go to Settings>Permission> Camera and allow access to Camera
ru: Перейдите в Настройки> Разрешения> Камера, и разрешите доступ к камере

# 相机权限未开启
source: Allow APP to access to the camera？
ru: Разрешить приложению доступ к камере?

# 请到手机系统的 【设置】->【隐私】->【相机】 对%@开启相机的访问权限
source: Go to Settings>Permission> Camera and allow access to Camera
ru: Перейдите в Настройки>Разрешения>Камера и разрешите доступ к камере

# 只支持iOS8.0以上系统
source: Support for iOS8.0 and above only
ru: Поддерживается только для iOS 8. 0 и выше

# 帐号
source: Account
ru: Логин

# 密码
source: Password
ru: Пароль

# 登录
source: Login
ru: Войти

# 设置
source: Settings
ru: Настройки

# 设置服务器地址
source: Server address
ru: Адрес сервера

# 请设置服务器地址
source: Please set the server permission
ru: Укажите сервер

# 请输入账户
source: Enter account
ru: Введите логин

# 请输入密码
source: Enter password
ru: Введите пароль

# 账号或密码错误
source: Wrong account or password
ru: Неверный логин или пароль

# 用户名错误
source: Wrong username
ru: Неверный логин

# 密码错误
source: Wrong password
ru: Неверный пароль

# 用户不存在
source: User does not exit
ru: Пользователь не вышел

# 地图
source: Map
ru: Карта

# 主页
source: Homepage
ru: Основной экран

# 我的任务
source: My task
ru: Задачи

# 工作记录
source: Work record
ru: Журнал

# 注册锁
source: Register lock
ru: Рег. замка

# 注册钥匙
source: Register key
ru: Рег. ключа

# 系统参数
source: System parameter
ru: Параметры

# 申请开锁
source: Apply unlock
ru: 3аявка на открытие замка

# 开锁审核
source: Unlock audit
ru: проверка открытия замка

# 搜索蓝牙钥匙
source: Researching Bluetooth key
ru: Поиск Bluetooth ключа

# 暂无蓝牙
source: No result
ru: Нет результата

# 未连接
source: No connection
ru: Нет связи

# 连接中
source: Connecting
ru: Подключение

# 已连接
source: Connected
ru: Подключено

# 断开中
source: Disconnecting
ru: Отключение

# 连接钥匙失败
source: Failed to connect key
ru: Не удалось подключить ключ

# 名称
source: Name
ru: Имя

# 钥匙
source: Key
ru: Ключ

# 钥匙序号
source: Key number
ru: Номер ключа

# 注册钥匙成功
source: Register key successfully
ru: Ключ зарегистрирован

# 请连接锁
source: Please connect lock...
ru: Подключите замок...

# 设置初始化锁系统码钥匙
source: Set initialization lock system code key
ru: Добавить замок с помощью ключа

# 修改钥匙ID
source: Modify key ID
ru: Изменить ID ключа

# 修改钥匙ID失败
source: Failed to modify key ID
ru: Не удалось изменить ID ключа

# 该钥匙信息不存在
source: This key information is not exist
ru: Информация об ключе отсутствует

# 钥匙编号为空
source: Key ID is empty
ru: Пустое ID ключа

# 钥匙名称为空
source: Key name is empty
ru: Пустое имя ключа

# 钥匙编号重复
source: Key ID is repeated
ru: Такой ID ключа уже существует

# 钥匙名称重复
source: Key name is repeated
ru: Такое имя ключа уже существует

# 钥匙硬件编号重复
source: Key hardware number is repeated
ru: Аппаратный номер ключа повторяется

# 钥匙编号已超出范围
source: Key number is out of the range
ru: Номер ключа вне диапазона

# 请输入钥匙名称
source: Please enter the key name
ru: Введите наименование ключа

# 钥匙已存在，请勿重复注册
source: Key already exists, please do not register again
ru: ключ уже существует

# 该钥匙已丢失
source: The key has been lost
ru: ключ утерян

# 该钥匙已损坏
source: The key is damaged
ru: ключ поврежден

# 该钥匙已领出
source: The key has been taken out
ru: ключ получен

# 无部门权限可以操作该钥匙
source: The key can be operated without Department authority
ru: нет прав на управление ключом

# 请连锁，读取锁id...
source: Please connect, read ID of lock...
ru: Подключите и считайте IP замка...

# 连接锁失败
source: Failed to connect lock
ru: Не удалось подключить замок

# 锁ID
source: Lock ID
ru: ID замка

# 请输入锁名称
source: Please enter the lock name
ru: Введите имя замка

# 注册锁成功
source: Register lock successfully
ru: Замок зарегистрирован

# 修改锁ID
source: Modify lock ID
ru: Изменить ID замка

# 修改锁ID失败
source: Failed to modify lock ID
ru: Не удалось изменить ID замка

# 锁编号为空
source: Lock ID is empty
ru: Пустое ID замка

# 锁名称为空
source: Lock name is empty
ru: Пустое имя замка

# 与本部门的锁编号重复
source: Repeat with the lock ID of this department
ru: Повторите с ID замка этого объекта

# 与本部门的锁名称重复
source: Repeat with the lock name of this department
ru: Повторите с именем замка этого объекта

# 与其他部门的锁编号重复
source: Repeat with the lock ID of other department
ru: Повторите с ID замка для другого объекта

# 锁编号已超出范围
source: Lock number is out of range
ru: Номер замка вне диапазона

# 锁硬件编号重复
source: Hardware number is repeated
ru: Аппаратный номер замка повторяется

# 日期选择
source: Date selection
ru: Выберите даты

# 请选择开始时间
source: Please choose start time
ru: Выберите время начала

# 请选择结束时间
source: Please choose end time
ru: Выберите время окончания

# 查询
source: Query
ru: Поиск

# 开关锁记录
source: Switch lock record
ru: Журнал данных

# 开锁成功
source: Unlock successfully
ru: Открытие

# 设置成功
source: Set successes
ru: Успешно

# 设置失败
source: Set failed
ru: Ошибка

# 超出有效期
source: Beyond expiry date
ru: После окончания даты разрешения

# 没有权限
source: No permission
ru: Нет разрешения

# 超出时间范围
source: Beyond time range
ru: За пределами диапазона

# 蓝牙钥匙开锁成功
source: Bluetooth key unlocked successfully
ru: Закрыт Bluetooth ключом

# 蓝牙钥匙关锁成功
source: Bluetooth key locked successfully
ru: Открыто Bluetooth ключом

# 工作任务
source: Task
ru: Задачи

# 开关锁
source: Switch lock
ru: Выключение замка

# 初始化成功
source: Initialization data succeed
ru: Инициализация данных прошла успешно

# 连接钥匙成功
source: Key connection succeed
ru: Ключ соединен

# 钥匙号码不匹配
source: Key number do not match
ru: Номер ключа не совпадает

# 请开关锁
source: Please switch the lock
ru: Переключите замок

# 关锁成功
source: Unlock successfully
ru: Закрыт

# 任务已失效
source: Mission failure
ru: Задача не выполнена

# 锁列表
source: Lock list
ru: Список блокировки

# 暂无
source: Not yet
ru: Пока нет

# 退出
source: Log out
ru: Выйти из программы

# 确定退出当前帐号吗
source: Are you sure to logout?
ru: Вы уверены, что хотите выйти?

# 设备号码
source: Device number
ru: Номер устройства

# 服务器地址
source: Server address
ru: Адрес сервера

# 版本号
source: Version
ru: Версия

# 修改密码
source: Modify password
ru: Изменить пароль

# 点击修改
source: Click on modify
ru: Нажмите на кнопку Изменить

# 退出成功
source: Log out successfully
ru: Выход из программы…

# 原密码
source: Old password
ru: Старый пароль

# 新密码
source: New password
ru: Новый пароль

# 确认密码
source: Confirm password
ru: Подтвердите пароль

# 请输入原密码
source: Please enter the old password
ru: Введите старый пароль

# 请输入新密码
source: Please enter the new password
ru: Введите новый пароль

# 请输入确认密码
source: Please confirm password
ru: Подтвердите пароль

# 两次密码不一致
source: The two passwords do not match
ru: Пароль не совпадают

# 确定修改密码吗
source: Confirm the modify the password?
ru: Подтверждаете изменение пароля?

# 修改成功，请重新登录
source: Modify the password, please login again
ru: Измените пароль и снова войдите

# 原密码错误
source: Original password error
ru: Старой пароль не верный

# 新密码和旧密码相同
source: The new password is the same as old password
ru: Новый и старый пароль совпадают

# 请选择要删除的开锁申请
source: Please select the unlock application to delete
ru: Выберите заявку на открытие замка для удаления

# 确定要删除开锁申请？
source: Are you sure you want to delete the unlock request?
ru: AУдалить заявку на открытие замка?

# 删除成功
source: Successfully deleted
ru: Удалено успешно

# 新建申请开锁
source: New application unlock
ru: новая заявка на открытие замка

# 日期
source: Date
ru: дата

# 请选择要开的锁
source: Please select the lock to open
ru: Выберите замок

# 待审批
source: Pending approval
ru: подлежать утверждению

# 已驳回
source: Rejected
ru: отклонено

# 任务已存在
source: The task already exists
ru: 3адача уже существует

# 同意
source: Agree
ru: согласие

# 驳回
source: Reject
ru: отклонить

# 申请人
source: Applicant
ru: Заявитель

# 确定要同意开锁申请？
source: Are you sure you want to approve the unlock application?
ru: Вы уверены, что согласны на открытие замка?

# 确定要驳回开锁申请？
source: Are you sure you want to reject the unlock application?
ru: Вы уверены, что хотите отклонить ходатайство об открытии замка?
